#include<fan.h>

//第一个角落前进灭火并回家(最后是死循环)
void OF1J()
{
	YLC(147);         /* 8 ! */
	SIG=0;
	Left(70,100);	/* 4 ! */
	//灭火完成
	Left(52,200);	/* 9 ! */
	//回家
	YRC(121);			/* 15 ! */
	Left(33,200);	//进房间的相反量
	YRQ(0x28);
	Forward(48,200); /* 16 !确认 */
	Left(33,200);    /* 17 !确认 */
	while(DRZS()<0x30||DLZS()<0x30)			//直走直到左右一边感应到墙，考虑上微偏距离
	Forward(3,200);
	YLC(123);			 /* 18 ! */
	while(1) Keep();
}

//void OF2J()
//{
//						   //左转到初始平行位置再右转固定角度
//	Left()
//	while(SIG4==0||SIG5==0) //直到QTI传感器4、5检测到白色边界)
//	Forward(1,200);		/* 3 ! */
//	SIG=0;
//	Right(7,100);		/* 5 ! */
//	//灭火完成
//	Right(15,200);		/* 10 ! */
//	Forward(200,200);	/* 22 ! */
//	while(CSB()>/*11*/||DRZS()</*13*/) 	/* 11 13 ! */
//	Forward(1,200);
//	Left(14,200);		/* 12 ! */
//	//回家
//	YRC(x);			/* 15 ! */
//	Left(33,200);	//进房间的相反量
//	YRQ(0x28);
//	Forward(48,200); /* 16 !确认 */
//	Left(35,200);    /* 17 !确认 */
//	while(DRZS()<0x30||DLZS()<0x30)			//直走直到左右一边感应到墙，考虑上微偏距离
//	Forward(3,200);
//	YLC(x);			 /* 18 ! */
//	while(1) Keep();
//}
//
//void OF3J()
//{
//	YRQ(0x28);
//	YLC(x);         /* 8 ! */
//	SIG=0;
//	Right(8,100);	/* 6 ! */
//	//灭火完成
//	Right(25,200);	/* 14 ! */
//	YLQ(0x28);
//	YLC(x);         /* 23 ! */
//	Left(33,200);
//	//回家
//	YRC(x);			/* 15 ! */
//	Left(33,200);	//进房间的相反量
//	YRQ(0x28);
//	Forward(48,200); /* 16 !确认 */
//	Left(35,200);    /* 17 !确认 */
//	while(DRZS()<0x30||DLZS()<0x30)			//直走直到左右一边感应到墙，考虑上微偏距离
//	Forward(3,200);
//	YLC(x);			 /* 18 ! */
//	while(1) Keep();
//}